peterhagelhof7-cmd/esp-infoscreen/firmware/sdkconfig.defaults
# ==== esp-infoscreen — ESP-IDF Grundkonfiguration (ESP32-S3 N16R8) ====
# Uebernommen vom bewaehrten ESP-BMC-N16R8-Stand + Display-/LVGL-Ergaenzungen.

CONFIG_IDF_TARGET="esp32s3"

# --- Flash: 16 MB, QIO 80 MHz ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# --- PSRAM: 8 MB Octal (R8), 80 MHz ---
# (Falls ein reales Board wider Erwarten Quad-PSRAM hat: MODE_OCT -> MODE_QUAD.)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# Grosse statische Puffer (.bss mit EXT_RAM_BSS_ATTR) ins PSRAM legen, damit der
# knappe interne RAM (WiFi/LVGL/httpd) frei bleibt.
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# --- CPU 240 MHz ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# --- Eigene Partitionstabelle ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- FreeRTOS 1000 Hz (glattes LVGL-Timing) ---
CONFIG_FREERTOS_HZ=1000

# --- Groesserer Main-Task-Stack (Display-/LVGL-Init) ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# --- RGB-LCD: Neustart des Panels im VSYNC (verhindert Bild-Drift) ---
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y
# ACHTUNG: CONFIG_LCD_RGB_ISR_IRAM_SAFE NICHT aktivieren, solange der Framebuffer
# im PSRAM liegt (fb_in_psram=1)! Der IRAM-sichere RGB-ISR laeuft dann auch bei
# abgeschaltetem Flash-Cache (z.B. NVS-Zugriff), der Bounce-Refill greift aber
# auf den PSRAM-FB zu -> "Cache disabled but cached memory region accessed" ->
# Boot-Loop (kein Rollback, da App schon als gueltig markiert). Deaktiviert
# 2026-08-09. Artefakte werden stattdessen ueber 10s-Telegram-Poll + groesseren
# Bounce-Puffer gedaempft; verbleibende Rest-Glitches sind selten.

# --- HTTPS: Zertifikatsbundle (fuer esp_crt_bundle_attach) ---
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# mbedTLS-Allokationen ins PSRAM verlagern: ein einzelner TLS-Kontext braucht
# einen grossen zusammenhaengenden Block, der im internen RAM (durch WiFi/LVGL
# fragmentiert) zeitweise fehlt -> mbedtls_ssl_setup -0x008D. Im 8-MB-PSRAM ist
# reichlich Platz. Empfohlener Weg fuer TLS auf PSRAM-Boards.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# HW-AES ABSCHALTEN (-> Software-AES). Zusammen mit EXTERNAL_MEM_ALLOC liegen die
# TLS-Puffer im PSRAM; die HW-AES-Engine kann aber per DMA NICHT direkt auf PSRAM
# zugreifen und muss pro Record einen INTERNEN Bounce-Puffer allozieren. Bei
# knappem internen RAM (WiFi/LVGL/httpd) schlaegt das fehl:
#   E esp-aes: Failed to allocate memory
#   E esp-tls-mbedtls: read error :-0x0084
# -> abgebrochene HTTPS-Abrufe (Kino, OWM-Vorhersage). Software-AES arbeitet
# direkt auf den PSRAM-Puffern ohne interne DMA-Allokation; auf dem S3@240 MHz
# ist der CPU-Mehraufwand fuer die periodischen kleinen JSON-Abrufe vernachlaessigbar.
CONFIG_MBEDTLS_HARDWARE_AES=n

# --- OTA: Bootloader-Rollback (frisch geflashte App bleibt "pending", bis sie
# per esp_ota_mark_app_valid_cancel_rollback() bestaetigt wird; sonst faellt der
# Bootloader beim naechsten Neustart auf die vorige App zurueck) ---
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# --- LVGL (Farbtiefe 16 bit, passend zu RGB565) ---
CONFIG_LV_COLOR_DEPTH_16=y
# Groessere Schrift fuer gut lesbaren Text auf 800x480
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
